tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask"
cask_args require_sha: true
tap "homebrew/services"
tap "homebrew/cask-fonts"
brew "mas"


# Programming Utilities
brew "neovim"
brew "tmux"
# original ctags does the better work with lua programs, but the universal-ctags
# is the suggesting one by relating vim plugin
#brew "universal-ctags"
brew "ctags"
brew "direnv"
brew "bash" # required by nix-community/nix-direnv
brew "grep" # same as above

# Terminal Commands
brew "tree"
brew "wget"
brew "croc"
cask "rar"
brew "mosh"

# Desktop Editors
cask "libreoffice"
mas "Table Tool", id: 1122008420
cask "drawio"
cask "macdown"
mas "MindNode", id: 1289197285
cask "obsidian"
cask "zotero"
# DB Editors
mas "Sequel Ace", id: 1518036000
cask "mongodb-compass"
cask "redisinsight"
# Desktop IDEs
cask "vimr"
mas "Haskell", id: 841285201
mas "iMazing Profile Editor", id: 1487860882

# Chinese
mas "WeChat", id: 836500024
cask "bilibili"

# System Apps
cask "alacritty"
cask "firefox"
cask "tor-browser"
cask "clash-for-windows"
mas "Microsoft Remote Desktop", id: 1295203466
mas "The Unarchiver", id: 425424353
brew "aria2"
cask "iina"

# System Plugins
cask "font-fira-code"
cask "font-hanamina" # for rarely-used chinese characters
cask "love"
brew "sdl2"
brew "sdl2_gfx"
brew "sdl2_image"
brew "sdl2_mixer"
brew "sdl2_ttf"
