tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask"
cask_args require_sha: true
tap "homebrew/services"
tap "homebrew/cask-fonts"
brew "mas"


# Programming Utilities
brew "neovim"
# original ctags does the better work with lua programs, but the universal-ctags
# is the suggesting one by relating vim plugin
#brew "universal-ctags"
brew "ctags"
brew "direnv"
brew "bash" # required by nix-community/nix-direnv
brew "grep" # same as above
brew "tmux"
brew "mosh"
brew "graphviz" # graph golang benchmark
brew "stylua" # lua formatter
brew "black" # python formatter
## python3
brew "python@3"
## javascript
brew "deno"

# Terminal Commands
brew "tree"
brew "wget"
brew "croc"
cask "rar"

# Desktop Editors
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Table Tool", id: 1122008420
cask "drawio"
cask "macdown"
mas "MindNode", id: 1289197285
cask "obsidian"
cask "zotero"
cask "notion"
# DB Editors
mas "Sequel Ace", id: 1518036000
cask "mongodb-compass"
cask "redisinsight"
# Desktop IDEs
cask "vimr"
cask "visual-studio-code"
mas "Haskell", id: 841285201
mas "iMazing Profile Editor", id: 1487860882

cask "obs"
mas "WeChat", id: 836500024
cask "bilibili"

# System Apps
cask "alacritty"
cask "tor-browser"
brew "openconnect"
mas "Microsoft Remote Desktop", id: 1295203466
mas "The Unarchiver", id: 425424353
cask "disk-inventory-x"
cask "transmission"
cask "iina"
cask "youdaodict"

# System Plugins
cask "font-fira-code"
mas "Vimari", id: 1480933944
cask "love"
brew "sdl2"
brew "sdl2_gfx"
brew "sdl2_image"
brew "sdl2_mixer"
brew "sdl2_ttf"
