tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask"
cask_args require_sha: true
tap "homebrew/services"
tap "homebrew/cask-fonts"
brew "mas"

# Terminal Style
## vim
brew "neovim"
cask "vimr"
# original ctags does the better work with lua programs, but the universal-ctags
# is the suggesting one by relating vim plugin
#brew "universal-ctags"
brew "ctags"
## terminal
cask "alacritty"
brew "tmux"
brew "mosh"
brew "croc"
brew "direnv"
brew "tree"
brew "wget"
brew "bash"
brew "grep"
## dev utils
brew "graphviz" # graph golang benchmark
### python3
brew "python@3"
brew "black"
### lua
brew "stylua"
### php
brew "php"
brew "php-code-sniffer"
brew "php-cs-fixer"

# Desktop Workshop
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Table Tool", id: 1122008420
cask "macdown"
cask "drawio"
cask "obs"
mas "MindNode", id: 1289197285
cask "tiddly"
cask "zotero"
cask "tor-browser"
mas "Sequel Ace", id: 1518036000
cask "mongodb-compass"
cask "redisinsight"
mas "iMazing Profile Editor", id: 1487860882
mas "Haskell", id: 841285201
mas "WeChat", id: 836500024

# System Utilities
brew "openconnect"
mas "Microsoft Remote Desktop", id: 1295203466
mas "The Unarchiver", id: 425424353
cask "disk-inventory-x"
cask "transmission"
cask "vlc"

# Plugins
cask "love"
cask "font-fira-code"
mas "Vimari", id: 1480933944
